In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('cafe4.csv')
df

      메뉴      가격  칼로리 원산지    이벤트가
0  아메리카노  4500.0   10  콩고     NaN
1   카페라떼  5000.0  110  케냐  2000.0
2   카페모카  5500.0  250  한국  2000.0
3   카푸치노  5000.0  110  한국     NaN
4  에스프레소  4000.0   20  한국     NaN
5    밀크티  5900.0  210  한국     NaN
6     녹차  5300.0    0  한국     NaN

In [6]:
df.groupby('원산지').sum('가격')

          가격  칼로리    이벤트가
원산지
케냐    5000.0  110  2000.0
콩고    4500.0   10     0.0
한국   25700.0  590  2000.0

In [8]:
df.groupby(['원산지', '칼로리']).mean(numeric_only=True)

             가격    이벤트가
원산지 칼로리
케냐  110  5000.0  2000.0
콩고  10   4500.0     NaN
한국  0    5300.0     NaN
    20   4000.0     NaN
    110  5000.0     NaN
    210  5900.0     NaN
    250  5500.0  2000.0

In [8]:
df = pd.DataFrame({
    '과일': ['딸기', '블루베리', '딸기', '블루베리', '딸기', '블루베리', '딸기', '블루베리'],
    '등급': ['A', 'A', 'A', 'A', 'B', 'B', 'B', 'B'],
    '가격': [1000, None, 1500, None, 2000, 2500, None, 1800]  # 결측값 포함
})

df

     과일 등급      가격
0    딸기  A  1000.0
1  블루베리  A     NaN
2    딸기  A  1500.0
3  블루베리  A     NaN
4    딸기  B  2000.0
5  블루베리  B  2500.0
6    딸기  B     NaN
7  블루베리  B  1800.0

In [9]:
price = df.groupby('과일')['가격'].transform('mean') # 각 카테고리의 평균을 결측치에 채워줌
price

0    1500.0
1    2150.0
2    1500.0
3    2150.0
4    1500.0
5    2150.0
6    1500.0
7    2150.0
Name: 가격, dtype: float64

In [11]:
df.groupby('과일')['가격'].mean()

과일
딸기      1500.0
블루베리    2150.0
Name: 가격, dtype: float64

In [12]:
df['가격'] = df['가격'].fillna(price)
df

     과일 등급      가격
0    딸기  A  1000.0
1  블루베리  A  2150.0
2    딸기  A  1500.0
3  블루베리  A  2150.0
4    딸기  B  2000.0
5  블루베리  B  2500.0
6    딸기  B  1500.0
7  블루베리  B  1800.0

In [13]:
price = df.groupby(['과일', '등급'])['가격'].transform('mean')
price

0    1250.0
1    2150.0
2    1250.0
3    2150.0
4    1750.0
5    2150.0
6    1750.0
7    2150.0
Name: 가격, dtype: float64

In [14]:
df['가격'] = df['가격'].fillna(price)
df

     과일 등급      가격
0    딸기  A  1000.0
1  블루베리  A  2150.0
2    딸기  A  1500.0
3  블루베리  A  2150.0
4    딸기  B  2000.0
5  블루베리  B  2500.0
6    딸기  B  1500.0
7  블루베리  B  1800.0

In [15]:
coffee_data = {
    '커피종류': ['아메리카노', '아메리카노', '아메리카노', '라떼', '라떼', '라떼'],
    '컵크기': ['Small', 'Medium', 'Large', 'Small', 'Medium', 'Large'],
    '판매량': [120, 150, 200, 100, 130, 180]
}

df = pd.DataFrame(coffee_data)
df

    커피종류     컵크기  판매량
0  아메리카노   Small  120
1  아메리카노  Medium  150
2  아메리카노   Large  200
3     라떼   Small  100
4     라떼  Medium  130
5     라떼   Large  180

In [20]:
g = df.groupby(['커피종류', '컵크기']).sum()
g

              판매량
커피종류  컵크기
라떼    Large   180
      Medium  130
      Small   100
아메리카노 Large   200
      Medium  150
      Small   120

In [24]:
g.unstack()

        판매량
컵크기   Large Medium Small
커피종류
라떼      180    130   100
아메리카노   200    150   120

In [25]:
appetizer = pd.DataFrame({
    'Menu': ['Salad', 'Soup', 'Bread'],
    'Price': [5000, 3000, 2000]
})

# 메인 메뉴
main = pd.DataFrame({
    'Menu': ['Steak', 'Pasta', 'Chicken'],
    'Price': [15000, 12000, 10000]
})

print(appetizer)
print(main)

    Menu  Price
0  Salad   5000
1   Soup   3000
2  Bread   2000
      Menu  Price
0    Steak  15000
1    Pasta  12000
2  Chicken  10000

In [27]:
full_menu = pd.concat([appetizer, main], ignore_index=True)
full_menu

      Menu  Price
0    Salad   5000
1     Soup   3000
2    Bread   2000
3    Steak  15000
4    Pasta  12000
5  Chicken  10000

In [28]:
full_menu = pd.concat([appetizer, main], axis=1)
full_menu

    Menu  Price     Menu  Price
0  Salad   5000    Steak  15000
1   Soup   3000    Pasta  12000
2  Bread   2000  Chicken  10000

In [30]:
price = pd.DataFrame({
    'Menu': ['Salad', 'Soup', 'Steak', 'Pasta'],
    'Price': [5000, 3000, 15000, 12000]
})

# 메뉴와 칼로리
cal = pd.DataFrame({
    'Menu': ['Soup', 'Steak', 'Pasta', 'Salad'],
    'Calories': [100, 500, 400, 150]
})

# 두 데이터프레임을 'Menu'를 기준으로 병합
menu_info = pd.merge(price, cal, on='Menu')
menu_info

    Menu  Price  Calories
0  Salad   5000       150
1   Soup   3000       100
2  Steak  15000       500
3  Pasta  12000       400

In [ ]:
data = {
    '부서': ['개발', '기획', '기획', '기획', '개발', '개발'],
    '직급': ['대리', '과장', '대리', '과장', '대리', '과장'],
    '급여': [3000, 4000, 3200, 4200, 3500, 4500]
}

df = pd.DataFrame(data)
print("[원본 데이터]")
print(df)

[원본 데이터]
   부서  직급    급여
0  개발  대리  3000
1  기획  과장  4000
2  기획  대리  3200
3  기획  과장  4200
4  개발  대리  3500
5  개발  과장  4500

In [33]:
pt = df.pivot_table(index='부서', columns='직급', values='급여', aggfunc='mean')
pt

직급      과장      대리
부서
개발  4500.0  3250.0
기획  4100.0  3200.0

In [36]:
data = {
    '부서': ['개발', '기획', '기획', '기획', '개발', '개발'],
    '성별': ['남', '여', '남', '여', '남', '여'],
    '근속연수': [3, 5, 4, 6, 7, 8]
}

df = pd.DataFrame(data)
print("[원본 데이터]")
print(df)

[원본 데이터]
   부서 성별  근속연수
0  개발  남     3
1  기획  여     5
2  기획  남     4
3  기획  여     6
4  개발  남     7
5  개발  여     8

In [37]:
pv = df.pivot_table(index='부서', columns='성별', values='근속연수', aggfunc='mean')
pv

성별    남    여
부서
개발  5.0  8.0
기획  4.0  5.5

In [39]:
data = {
    '부서': ['개발', '기획', '기획', '기획', '개발', '개발'],
    '성별': ['남', '여', '남', '여', '남', '여'],
    '근속연수': [3, 5, 4, 6, 7, 8]
}

df = pd.DataFrame(data)
print("[원본 데이터]")
print(df)

[원본 데이터]
   부서 성별  근속연수
0  개발  남     3
1  기획  여     5
2  기획  남     4
3  기획  여     6
4  개발  남     7
5  개발  여     8

In [43]:
pv = df.pivot_table(index='부서', columns='성별', values='근속연수', aggfunc=['sum','mean'])
pv

   sum     mean
성별   남   여    남    여
부서
개발  10   8  5.0  8.0
기획   4  11  4.0  5.5